app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `commenter`, `created_at`, `post_id`, `updated_at`) VALUES ('cccc1', 'c1', '2016-05-20 06:49:06', 1, '2016-05-20 06:49:06')
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.post = @post
    if @comment.save

DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    if @comment.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def find_post_by_id
    @post = Post.find_by_id(params[:post_id])

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 AND `comments`.`id` = 1 LIMIT 1
---
  def find_comment_by_id
    @comment = @post.comments.find_by_id(params[:id])