app/controllers/posts_controller.rb

INSERT INTO `posts` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('content111111', '2016-05-20 06:26:26', 'name1', 'title111', '2016-05-20 06:26:26')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
---
  def update
    @post = Post.find(params[:id])